[
  {
    "review_id": 1,
    "review": "Be careful booking thru Priceline. I don't see any active hotel review link. Just spent the night in an absolute dump. Place should be condemned or at least not offered to the travelling public in Fort Lauderdale. No pool, no elevator, property looked smelled horrible, undesirables everywhere, no lobby just a drive up transaction window. Web pictures are all lies. You get the idea. Drive past and keep going. Oh and there seems to be no way to get in touch with Priceline to get a potential refund"
  },
  {
    "review_id": 2,
    "review": "The worst customer service ever. I book a reservation via the Priceline site with an hotel in NYC. During my check out the hotel ask me for the resort fee that they collect by directly. I noticed their is a different of 80$ between what I should pay and what the hotel charge me (the same issue happened to my colleague). I contacted Priceline, and after almost a month they still \"trying\" to solve the issue.\nOne of the worst customer service I ever got.\nNever will use them again."
  },
  {
    "review_id": 3,
    "review": "I have been a platinum member, and regularly booking with them for at least 5 years. Never had an issue until today, to realize their customer service was terrible.\nI'm unable to speak to a supervisor, line drops and long wait line and still nothing.\nThey advertise the wrong location on their website and no one wants to take responsibility to their error."
  },
  {
    "review_id": 4,
    "review": "I am a retired airline employee and love to travel but things these days change as did my plans.\nI had to put off my trip by one day in Nashville and priceline refused to change my rental car reservation. The price was the same with there site for both days and there was plenty of cars available. Absolutely no flexability so I booked with Expedia and it was actually cheaper and they have a change/cancellation policy. I can see why the overall rating with priceline is so low."
  },
  {
    "review_id": 5,
    "review": "This was my worst experience with a website to book flights! They told me that I can change my flight to any country with a charge of $200 and now they are saying that it's only within Indonesia because I want to shorten my trip with Bali and go to a different country and then back to mine. I advise not to use this website for booking flights. They are not trustworthy."
  },
  {
    "review_id": 6,
    "review": "I will never again use Priceline for booking flights. You're basically paying for \"stand by\" and good luck getting to your destination. Not only did my son get denied TWICE by the airlines for not having seats for him they refused to let me cancel and refund my money. He was stranded at the airport for over 10 hours by himself. I ended up having to buy another ticket from the actual airlines to get him home. This was the worst experience for a mother trying to get her son home. Tip for consumers:\nTell people that there is no guarantee that they will get a flight!!\n\nProducts used:\nI had to book a same-day flight with the direct airline."
  },
  {
    "review_id": 7,
    "review": "Rented a car thru them and when Southwest cancelled all their flights could not get a refund Paying $267 for nothing Just a bunch of scammers\nHope the go belly up soon\n\nTip for consumers:\nThey do not know how to do business"
  },
  {
    "review_id": 8,
    "review": "Car rental for a week due to mechanical problems with mine. I picked up car & had it 4 1 day no refund"
  },
  {
    "review_id": 9,
    "review": "I am a VIP member and used Priceline for many bookings, but God Forbid, you actually need customer service or a manager to handle something! You are lucky they pick up the phone, they are answering from a 3rd world country and just repeat the same thing over and over! I am deleting my account and will never book anything with them again! My flight time changed and I can not fly on those dates now and they refuse to refund me the return flight cost! $275 down the drain!"
  },
  {
    "review_id": 10,
    "review": "Buyer beware. Read the fine print. Priceline doesn't honor the time you actually rent a vehicle, they charge you the same even if you turn the vehicle in earlier than your scheduled turn-in date. Turning in a rental car early is never charged by ANY rental car company I've ever dealt with. Absolute frauds. Trust me. Just go direct with the rental car company. It's not worth the extra few dollars you save. Tip for consumers:\nDon't use priceline. They don't care if they rip you off for the time you didn't have a rental car, and take your money anyways.\n\nProducts used:\nrental car"
  },
  {
    "review_id": 11,
    "review": "Put in my search criteria to reflect pet friendly and then was offered a great fast deal. Turns out the hotel is not pet friendly and Priceline refused to refund or replace hotel. I've used them for 20 years in excess of ******* a year and will be headed now to a travel site that will respect my repeated VIP membership! BUYER BEWARE! Priceline is owned by the same company as Expedia, Orbitz, hotels.com and Travelocity,- so you might want to avoid those as well."
  },
  {
    "review_id": 12,
    "review": "I canceled a reservation before it went through and Priceline charged me anyway. Not knowing that they charged me and our plans finalized, I booked my reservation. I contacted them and they told me I couldn't be refunded. I asked to speak with a manager and the same customer service rep came back on the line and pretended to be a manager. I'm disgusted to have given them $157.97. I will never use them again.\n\nTip for consumers:\nIf your booking with them, don’t expect a refund.\n\nProducts used:\nOne hotel room"
  },
  {
    "review_id": 13,
    "review": "Priceline is first and foremost a scam. I was double charged and put on 'customer service help' for over 6 hours yesterday. I was double charged on Paypal and Priceline keeps sending me in circles. The average response time during a customer service chat, messaging or phone call is about 20-30 minutes.\nThis place stole $250 from me right during the height of Black Friday Christmas shopping and everytime I try to contact them I can't get through. Today apparently their 'site is down'. I do not ever recommend anyone using Priceline. It was probably one of the worst experiences I have ever had with a hotel reservation- and I did 10 years of travelling soccer with 2 boys! Stay away. Don't give them ANY access to your money. They steal it and refuse to even talk to you about getting refunded.\n\nTip for consumers:\nDo NOT book with Priceline unless you want to have money removed from your bank without your permission and then spending 8 hours trying to contact their customer service with ZERO results. Avoid Priceline like the plague. They ruined my trip a month before I can even take it!!!\n\nProducts used:\nI booked a hotel in Michigan for two nights over the upcoming Christmas Holiday and I was double charged for the same trip and the prices were $20 different. I have been on messaging, instant messenger, texting and calling to try to get this issue resolved. Every text I sent yesterday took about 20-30 minutes for a response. I was trying to get them to help me from about 10:30/11 am yesterday and as of 6 pm I still had no result. I was just asked the same question over and over and they said they couldn't see anything wrong. I tried to continue on with them today, but their \"system is down\" and they say it will be fixed soon, but it hasn't been fixed in the amount of time they suggested. This site steals your money and then makes it impossible to get a refund. This little stunt of theirs is robbing me of $250 in Christmas shopping money over the Black Friday/Cyber Monday shopping period. I will never ever use this company again. I will happily pay $20 more to actually RECEIVE ANY KIND of customer service."
  },
  {
    "review_id": 14,
    "review": "Priceline from bad companies going the wost companies, Book hotel room only, website over breakfast and@ more money, find hotel never over breakfast, also most hotel room we travel have BUGS & worst thing BEDBUGS.\nAnd hotel told us to get refund because 3 part companies, never return money because excuse no refund policy.\nPriceline your are $#*!holl people's CON, MANIPULATE People's"
  },
  {
    "review_id": 15,
    "review": "Impossible to get credit if your flight is canceled\nCall the agent and she kept on asking me stupid question after trip number that should provide her with all the information she kept on asking about my name phone number what flight number and mine what hotel I'm in all that information right in front of her on the computer but they love to drive you crazy"
  },
  {
    "review_id": 16,
    "review": "On my 10 year anniversary I booked with Priceline a room with a hot tub in it. The agent confirmed that the hotel he found had a hot tub in it so my husband and I drove 45 minutes from our home to another city to stay at this hotel when we got there that amenity was not available and none of their rooms had hot tubs so we left and came home. I then requested a refund for misrepresentation and have only been given the runaround since. They have not taken responsibility or accountability for misrepresenting the hotel and refuse to refund my money.\nI have booked all of my trips through Priceline but going forward I will never use Priceline again. And I will be filing a complaint with a Better Business Bureau and my attorney general.\nI only requested that Priceline do their due diligence and review all the information including the recorded conversations of when I booked this stay to make a fair decision. They have instead chosen to not do that and just keep passing me off to another person to another person to another company getting new resolution I'm extremely disappointed."
  },
  {
    "review_id": 17,
    "review": "I typically book directly with a preferred company, but it was Thanksgiving weekend and prices were out of control. I checked Priceline and decided to give it a try. I used Priceline to book a car rental with National and found a great deal that was half the price I found with National directly. I had zero issues. After paying through Priceline and reading the fine print about No Changes/No Cancels/No Refunds, I checked my booking on the National site and all my info was there. When I arrived at my destination, check-in was fine. After returning the car a few days later, I got a receipt from National and an email from Priceline. All good!\n\nI would use Priceline again.\n\nTip for consumers:\nRead all of the fine print and don't assume they'll make exceptions for you.\n\nProducts used:\nCar rental"
  },
  {
    "review_id": 18,
    "review": "Priceline is awful. Everything that was once good has been taken away from their offerings. Terrible customer service, no refunds no matter what. Crappy prices. DO NOT USE\n\nTip for consumers:\nDO NOT USE\n\nProducts used:\nRental car service"
  },
  {
    "review_id": 19,
    "review": "Priceline double booked me for a car rental because of a website glitch on THEIR end. I called their customer service and was told that because of their \"No cancellation policy\", they cannot cancel and refund me for the second booking—even though the malfunction occurred on their side! I am being charged for 2 cars for the same dates and same driver when I only booked one! They are scam artists!\n\nTip for consumers:\nDo NOT use Priceline. They lure you in with supposed savings but will rip you off.\n\nProducts used:\nCar rental"
  },
  {
    "review_id": 20,
    "review": "I was out of state, needed to get home and couldn't get a flight so I rented a via Priceline with Avis. I had tp pay 26.00 up front to Priceline for the insurance. They never stated that I would need a credit card as Avis does not accept Debit cards, that was all I had, or cash. I had to rent elsewhere, and there is no way to contact Price line to get a refund. Terrible\n\nTip for consumers:\nDon't use this site"
  },
  {
    "review_id": 21,
    "review": "I went through priceline to book a hotel for 4 nights. I was charged $311. When I checked out my receipt for the 4 nights stay was only $228.08. So just to use their site to book a hotel was around $83. So from now on I will NEVER use Priceline again and I urge anyone thinking about using their site to do a little research and find the good deals yourself.\n\nTip for consumers:\nDONT USE PRICELINE. If you want to save money do the research yourself!!!!\n\nProducts used:\nI used the hotel stay I had initially booked"
  },
  {
    "review_id": 22,
    "review": "This deserves a 0 star. I was booking a hotel for my upcoming vacation. I was going to be in the city for 4 nights, their website glitched and booked me in for 5 nights charging my CC. Immediately after making my booking I called them and let them know it booked me for an extra change weirdly (not even 2 mins later). And they told me they could do something but only after the weekend (3 business days later).\nI called again during the week and they told me sorry it's a no refund policy despite it literally being an issue with the NOT USER FRIENDLY website. The customer service is awful! I now have an extra night booked somewhere where I won't be. But clearly from all the reviews they are NOTORIOUS for this. I wish I read reviews prior to booking anything on their website. Never again ….\n\nTip for consumers:\nDon’t use it\n\nProducts used:\nHotel booking"
  },
  {
    "review_id": 23,
    "review": "The flight canceled by the Airline ( Air Canada Flight number AC8776 December 24) and everyone can see that in the Air Canada website) but the Priceline didn't accept that and told me you didn't show up. Not only me all passengers was there unit 11:50pm and we got cancellations confirmation email too but the Priceline didn't accept that.\nNot honest and not responsible people and company."
  },
  {
    "review_id": 24,
    "review": "During the holiday season, I tried to purchase a flight on Priceline.com, but the site processed my money but wouldn't provide me with a ticket because the price went up in the middle of my transaction. They reneged on the pricing, and it was a nuisance to get my money back a day later. After discussing the issue with a supervisor named Yanis, I learned that no one there cared that prices were going up on other sites; this was the worst service I've ever had. Never again will I visit this site."
  },
  {
    "review_id": 25,
    "review": "I booked our vacation through Priceline and neglected to pay attention to the car rental company they were providing until we arrived at the airport.\n\nUpon arrival I realized that we were assigned some company that I had never heard of called Green Motion. They were not located at the airport and we had to wait over 1/2 an hour for their shuttle to arrive.\n\nWhen we finally made it it the rental office, we were informed that we could not use our insurance which is through State Farm because this company requires $500,000 minimum coverage. I have never encountered this problem before from the many well know car rental companies that I have used over the years. We were forced to purchase their insurance at $40 per day because the rental was non cancellable through Priceline. Such BS!\n\nI surprised that Priceline would use a company like this thats obviously running a scam business.\n\nIf you book an auto rental through Priceline and they have you booked with Green Motion, do not purchase it!"
  }
]